[
  {
    "id": "sight/iron/carry_handle",
    "copy-from": "@sight/iron",
    "type": "GUNMOD",

    "//sources": [
      [
        "https://www.midwayusa.com/product/1026502788",
        "area  reference",
        "price"
      ],
      ["TC 3-22.9", "weight"],
      ["M4 Technical Data Package", "width"],
      [
        "https://en.wikipedia.org/wiki/M16_rifle",
        "sight dispersion reference",
        "field of view reference"
      ]
    ],

    "//notes": [
      "Colt website lists MidwayUSA as one of the two stores selling authentic Colt parts, so we assume their price is the most authentic"
    ],

    "name": { "str": "AR-15 carry handle sight" },
    "description": "An iconic carry-handle-style sight from military AR-15s, such as the M16 and the M4.  This one is detachable and can be mounted as a regular sight.  Can only be installed on AR-15-style rifles.",
    "expand_snippets": true,

    "variant_type": "gun",
    "variants": [
      {
        "id": "steel",

        "name": {
          "str": "M16 carry handle sight"
        },
        "description": "An iconic M16-style carry handle rear sight.  This model is Picatinny-mounted, designed to provide a familiar set of irons to soldiers while also being replaceable with reflex or optical sights.  As this is just a rear sight, it requires the common gas-block front sight found on AR-15-style rifles, and thus can only be mounted on those.  <variant:steel>",
        "expand_snippets": true,
        "weight": 1
      }
    ],

    "//weight": "20.8 oz = 589.67 g",
    "weight": "590 g",
    "//dimensions": {
      "area": "11.1 in2",
      "width": "1.01 in",
      "raw": "165.34 ml",
      "trim": 0.25,
      "notes": [
        "width acquired from measuring out all of the available dimensions of the carry handle sight",
        "TC's width seems to account for every single bit sticking out, which is not the value we need"
      ]
    },
    "volume": "124 ml",
    "//longest_side": ["7.32 in = 185.93 mm", "Feret distance"],
    "longest_side": "186 mm",

    "//field_of_view": [
      "12.18 MOA",
      "calculated as tangent of rear aperture diameter (0.07 in.) over sight radius (19.75 in.)"
    ],
    "field_of_view": 12,
    "//sight_dispersion": [
      "13.05 MOA",
      "calculated as tangent of front sight post width (0.075 in.) over sight radius (19.75 in.)"
    ],
    "sight_dispersion": 52,
    "//aim_speed_modifier": -5,
    "//mod_targets": [
      [
        "our current CQBR model is Block II, and thus does not come with front sight post gas block",
        "should we ever model a Block I CQBR, we should add it to the list"
      ],
      "M27 IAR does not use a front sight post gas block"
    ],
    "mod_targets": ["modular_ar15", "modular_m4_carbine", "modular_m16a4"],

    "price": "142 USD 90 cent"
  }
]
